Revit 2024 API
NumberingSchemaTypes.StructuralNumberingSchemas.Rebar Property
 Built-in schema used for numbering rebar elements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static NumberingSchemaType Rebar { get; }
Visual Basic
Public Shared ReadOnly Property Rebar As NumberingSchemaType
	Get
Visual C++
public:
static property NumberingSchemaType^ Rebar {
	NumberingSchemaType^ get ();
}
See Also
NumberingSchemaTypes.StructuralNumberingSchemas Class
Autodesk.Revit.DB Namespace